Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForFamilyInstanceFailures.PartsCannotBeCreatedFromInvalidFamInstGeom
Post failure when attempts to create parts from family instance that has invalid geometry.

Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForFamilyInstanceFailures
Failures related to part creation from family instances.